{
  "0": {
    "Method": "dsRNA-seq",
    "Year": 2010,
    "Name": "Double-stranded RNA sequencing",
    "Publication": "Genome-Wide Double-Stranded RNA Sequencing Reveals the Functional Significance of Base-Paired RNAs in Arabidopsis",
    "Published by": "Zheng Q, Ryvkin P, Li F, Dragomir I, Valladares O, et al.",
    "Publication abstract": "The functional structure of all biologically active molecules is dependent on intra- and inter-molecular interactions. This is especially evident for RNA molecules whose functionality, maturation, and regulation require formation of correct secondary structure through encoded base-pairing interactions. Unfortunately, intra- and inter-molecular base-pairing information is lacking for most RNAs. Here, we marry classical nuclease-based structure mapping techniques with high-throughput sequencing technology to interrogate all base-paired RNA in Arabidopsis thaliana and identify ~200 new small (sm)RNA–producing substrates of RNA–DEPENDENT RNA POLYMERASE6. Our comprehensive analysis of paired RNAs reveals conserved functionality within introns and both 5′ and 3′ untranslated regions (UTRs) of mRNAs, as well as a novel population of functional RNAs, many of which are the precursors of smRNAs. Finally, we identify intra-molecular base-pairing interactions to produce a genome-wide collection of RNA secondary structure models. Although our methodology reveals the pairing status of RNA molecules in the absence of cellular proteins, previous studies have demonstrated that structural information obtained for RNAs in solution accurately reflects their structure in ribonucleoprotein complexes. Furthermore, our identification of RNA–DEPENDENT RNA POLYMERASE6 substrates and conserved functional RNA domains within introns and both 5′ and 3′ untranslated regions (UTRs) of mRNAs using this approach strongly suggests that RNA molecules are correctly folded into their secondary structure in solution. Overall, our findings highlight the importance of base-paired RNAs in eukaryotes and present an approach that should be widely applicable for the analysis of this key structural feature of RNA.",
    "Publication data": "GSE23439",
    "Publication doi": "10.1371/journal.pgen.1001141",
    "Probe": "RNase One",
    "Probe class": "Enzyme",
    "Probe target": "Phosphate backbone",
    "Target region": "Single stranded",
    "Readout": "Cleavage",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "At2g07698 and At4g02510 transcripts",
    "Validated in": "Arabidopsis thaliana",
    "Workflow": "_NA_",
    "Figure reuse license": "_NA_"
  },
  "1": {
    "Method": "FragSeq",
    "Year": 2010,
    "Name": "Fragmentation sequencing",
    "Publication": "FragSeq: transcriptome-wide RNA structure probing using high-throughput sequencing",
    "Published by": "Jason G Underwood, Andrew V Uzilov, Sol Katzman, Courtney S Onodera, Jacob E Mainzer, David H Mathews, Todd M Lowe, Sofie R Salama & David Haussler",
    "Publication abstract": "Classical approaches to determine structures of noncoding RNA (ncRNA) probed only one RNA at a time with enzymes and chemicals, using gel electrophoresis to identify reactive positions. To accelerate RNA structure inference, we developed fragmentation sequencing (FragSeq), a high-throughput RNA structure probing method that uses high-throughput RNA sequencing of fragments generated by digestion with nuclease P1, which specifically cleaves single-stranded nucleic acids. In experiments probing the entire mouse nuclear transcriptome, we accurately and simultaneously mapped single-stranded RNA regions in multiple ncRNAs with known structure. We probed in two cell types to verify reproducibility. We also identified and experimentally validated structured regions in ncRNAs with, to our knowledge, no previously reported probing data.",
    "Publication data": "GSE24622",
    "Publication doi": "10.1038/nmeth.1529",
    "Probe": "Nuclease P1",
    "Probe class": "Enzyme",
    "Probe target": "Phosphate backbone",
    "Target region": "Single stranded",
    "Readout": "Cleavage",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "Mouse: U1a, U2, U3b, U4b, U5, U6, U8, U11, U12; Human: U3, U5",
    "Validated in": "Mouse, human",
    "Workflow": "<img alt='fragseq fig' src='../images/fragseq.jpg'>",
    "Figure reuse license": "4577411383783"
  },
  "2": {
    "Method": "PARS",
    "Year": 2010,
    "Name": "Parallel analysis of RNA structure",
    "Publication": "Genome-wide measurement of RNA secondary structure in yeast",
    "Published by": "Michael Kertesz, Yue Wan, Elad Mazor, John L. Rinn, Robert C. Nutter, Howard Y. Chang & Eran Segal",
    "Publication abstract": "The structures of RNA molecules are often important for their function and regulation, yet there are no experimental techniques for genome-scale measurement of RNA structure. Here we describe a novel strategy termed parallel analysis of RNA structure (PARS), which is based on deep sequencing fragments of RNAs that were treated with structure-specific enzymes, thus providing simultaneous in vitro profiling of the secondary structure of thousands of RNA species at single nucleotide resolution. We apply PARS to profile the secondary structure of the messenger RNAs (mRNAs) of the budding yeast Saccharomyces cerevisiae and obtain structural profiles for over 3,000 distinct transcripts. Analysis of these profiles reveals several RNA structural properties of yeast transcripts, including the existence of more secondary structure over coding regions compared with untranslated regions, a three-nucleotide periodicity of secondary structure across coding regions and an anti-correlation between the efficiency with which an mRNA is translated and the structure over its translation start site. PARS is readily applicable to other organisms and to profiling RNA structure in diverse conditions, thus enabling studies of the dynamics of secondary structure at a genomic scale.",
    "Publication data": "GSE22393",
    "Publication doi": "10.1038/nature09322",
    "Probe": "RNase V1, S1",
    "Probe class": "Enzyme",
    "Probe target": "Phosphodiester bond",
    "Target region": "Single stranded (S1), double stranded (V1)",
    "Readout": "Cleavage",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "CCW12, RPL41A, ASH1, URE2",
    "Validated in": "Yeast",
    "Workflow": "<img alt='pars fig' src='../images/pars.jpg'>",
    "Figure reuse license": "4611171285662"
  },
  "3": {
    "Method": "CLASH",
    "Year": 2011,
    "Name": "Crosslinking, ligation, and sequencing of hybrids",
    "Publication": "Cross-linking, ligation, and sequencing of hybrids reveals RNA–RNA interactions in yeast",
    "Published by": "Grzegorz Kudla, Sander Granneman, Daniela Hahn, Jean D. Beggs, and David Tollervey",
    "Publication abstract": "Many protein–protein and protein–nucleic acid interactions have been experimentally characterized, whereas RNA–RNA interactions have generally only been predicted computationally. Here, we describe a high-throughput method to identify intramolecular and intermolecular RNA–RNA interactions experimentally by cross-linking, ligation, and sequencing of hybrids (CLASH). As validation, we identified 39 known target sites for box C/D modification-guide small nucleolar RNAs (snoRNAs) on the yeast pre-rRNA. Novel snoRNA-rRNA hybrids were recovered between snR4-5S and U14-25S. These are supported by native electrophoresis and consistent with previously unexplained data. The U3 snoRNA was found to be associated with sequences close to the 3′ side of the central pseudoknot in 18S rRNA, supporting a role in formation of this structure. Applying CLASH to the yeast U2 spliceosomal snRNA led to a revised predicted secondary structure, featuring alternative folding of the 3′ domain and long-range contacts between the 3′ and 5′ domains. CLASH should allow transcriptome-wide analyses of RNA–RNA interactions in many organisms.",
    "Publication data": "Request from the authors",
    "Publication doi": "10.1073/pnas.1017386108",
    "Probe": "_NA_",
    "Probe class": "Crosslinking and ligation",
    "Probe target": "_NA_",
    "Target region": "Double stranded",
    "Readout": "_NA_",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "U2",
    "Validated in": "Yeast",
    "Workflow": "<img alt='clash fig' src='../images/clash.jpg'>",
    "Figure reuse license": "Granted by PNAS Executive Editor Diane Sullenberger"
  },
  "4": {
    "Method": "SHAPE-Seq",
    "Year": 2011,
    "Name": "Selective 2'-hydroxyl acylation analyzed by primer extension sequencing",
    "Publication": "Multiplexed RNA structure characterization with selective 2′-hydroxyl acylation analyzed by primer extension sequencing (SHAPE-Seq)",
    "Published by": "Julius B. Lucks, Stefanie A. Mortimer, Cole Trapnell, Shujun Luo, Sharon Aviran, Gary P. Schroth, Lior Pachter, Jennifer A. Doudna, and Adam P. Arkin",
    "Publication abstract": "New regulatory roles continue to emerge for both natural and engineered noncoding RNAs, many of which have specific secondary and tertiary structures essential to their function. Thus there is a growing need to develop technologies that enable rapid characterization of structural features within complex RNA populations. We have developed a high-throughput technique, SHAPE-Seq, that can simultaneously measure quantitative, single nucleotide-resolution secondary and tertiary structural information for hundreds of RNA molecules of arbitrary sequence. SHAPE-Seq combines selective 2′-hydroxyl acylation analyzed by primer extension (SHAPE) chemistry with multiplexed paired-end deep sequencing of primer extension products. This generates millions of sequencing reads, which are then analyzed using a fully automated data analysis pipeline, based on a rigorous maximum likelihood model of the SHAPE-Seq experiment. We demonstrate the ability of SHAPE-Seq to accurately infer secondary and tertiary structural information, detect subtle conformational changes due to single nucleotide point mutations, and simultaneously measure the structures of a complex pool of different RNA molecules. SHAPE-Seq thus represents a powerful step toward making the study of RNA secondary and tertiary structures high throughput and accessible to a wide array of scientific pursuits, from fundamental biological investigations to engineering RNA for synthetic biological systems.",
    "Publication data": "Request from the authors",
    "Publication doi": "10.1073/pnas.1106501108",
    "Probe": "1M7",
    "Probe class": "Chemical",
    "Probe target": "Ribose 2'-OH",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary and tertiary",
    "Validated by": "RNase P specificity domain",
    "Validated in": "Bacillus subtilis",
    "Workflow": "<img alt='shape-seq fig' src='../images/shape-seq.jpg'>",
    "Figure reuse license": "Granted by PNAS Executive Editor Diane Sullenberger"
  },
  "5": {
    "Method": "ssRNA-seq",
    "Year": 2012,
    "Name": "Single-stranded RNA sequencing",
    "Publication": "Global analysis of RNA secondary structure in two metazoans",
    "Published by": "Li F, Zheng Q, Ryvkin P, Dragomir I, Desai Y, Aiyer S, Valladares O, Yang J, Bambina S, Sabin LR, Murray JI, Lamitina T, Raj A, Cherry S, Wang LS, Gregory BD.",
    "Publication abstract": "The secondary structure of RNA is necessary for its maturation, regulation, processing, and function. However, the global influence of RNA folding in eukaryotes is still unclear. Here, we use a high-throughput, sequencing-based, structure-mapping approach to identify the paired (double-stranded RNA [dsRNA]) and unpaired (single-stranded RNA [ssRNA]) components of the Drosophila melanogaster and Caenorhabditis elegans transcriptomes, which allows us to identify conserved features of RNA secondary structure in metazoans. From this analysis, we find that ssRNAs and dsRNAs are significantly correlated with specific epigenetic modifications. Additionally, we find key structural patterns across protein-coding transcripts that indicate that RNA folding demarcates regions of protein translation and likely affects microRNA-mediated regulation of mRNAs in animals. Finally, we identify and characterize 546 mRNAs whose folding pattern is significantly correlated between these metazoans, suggesting that their structure has some function. Overall, our findings provide a global assessment of RNA folding in animals.",
    "Publication data": "GSE29571",
    "Publication doi": "10.1016/j.celrep.2011.10.002",
    "Probe": "RNase V1",
    "Probe class": "Enzyme",
    "Probe target": "Phosphate backbone",
    "Target region": "Double stranded",
    "Readout": "Cleavage",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "FBtr0072789, FBtr0100406, FBtr0078144, FBtr0082231, FBtr0088499, and FBtr0077014",
    "Validated in": "Drosophila melanogaster",
    "Workflow": "_NA_",
    "Figure reuse license": "_NA_"
  },
  "6": {
    "Method": "PARTE",
    "Year": 2012,
    "Name": "Parallel Analysis of RNA structures with Temperature Elevation",
    "Publication": "Genome-wide Measurement of RNA Folding Energies",
    "Published by": "Wan, Yue, Qu, Kun, Ouyang, Zhengqing, Kertesz, Michael, Li, Jun, Tibshirani, Robert, Makino, Debora L., Nutter, Robert C., Segal, Eran, Chang, Howard Y.",
    "Publication abstract": "RNA structural transitions are important in the function and regulation of RNAs. Here, we reveal a layer of transcriptome organization in the form of RNA folding energies. By probing yeast RNA structures at different temperatures, we obtained relative melting temperatures (Tm) for RNA structures in over 4000 transcripts. Specific signatures of RNA Tm demarcated the polarity of mRNA open reading frames and highlighted numerous candidate regulatory RNA motifs in 3′ untranslated regions. RNA Tm distinguished noncoding versus coding RNAs and identified mRNAs with distinct cellular functions. We identified thousands of putative RNA thermometers, and their presence is predictive of the pattern of RNA decay in vivo during heat shock. The exosome complex recognizes unpaired bases during heat shock to degrade these RNAs, coupling intrinsic structural stabilities to gene regulation. Thus, genome-wide structural dynamics of RNA can parse functional elements of the transcriptome and reveal diverse biological insights.",
    "Publication data": "GSE39680",
    "Publication doi": "10.1016/j.molcel.2012.08.008",
    "Probe": "RNase V1",
    "Probe class": "Enzyme",
    "Probe target": "Phosphodiester bond",
    "Target region": "Double stranded",
    "Readout": "Cleavage",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "SCR1, snR52, YCR024C-A, RDN58-1, YER138W-A, snR60, snR68, snR75, snR24, snR39B, snR18, snR13, and Tetrahymena ribozyme",
    "Validated in": "Yeast",
    "Workflow": "_NA_",
    "Figure reuse license": "_NA_"
  },
  "7": {
    "Method": "ChemModSeq",
    "Year": 2014,
    "Name": "_NA_",
    "Publication": "Snapshots of pre-rRNA structural flexibility reveal eukaryotic 40S assembly dynamics at nucleotide resolution",
    "Published by": "Ralph D. Hector, Elena Burlacu, Stuart Aitken, Thierry Le Bihan, Maarten Tuijtel, Alina Zaplatina, Atlanta G. Cook, Sander Granneman",
    "Publication abstract": "Ribosome assembly in eukaryotes involves the activity of hundreds of assembly factors that direct the hierarchical assembly of ribosomal proteins and numerous ribosomal RNA folding steps. However, detailed insights into the function of assembly factors and ribosomal RNA folding events are lacking. To address this, we have developed ChemModSeq, a method that combines structure probing, high-throughput sequencing and statistical modeling, to quantitatively measure RNA structural rearrangements during the assembly of macromolecular complexes. By applying ChemModSeq to purified 40S assembly intermediates we obtained nucleotide-resolution maps of ribosomal RNA flexibility revealing structurally distinct assembly intermediates and mechanistic insights into assembly dynamics not readily observed in cryo-electron microscopy reconstructions. We show that RNA restructuring events coincide with the release of assembly factors and predict that completion of the head domain is required before the Rio1 kinase enters the assembly pathway. Collectively, our results suggest that 40S assembly factors regulate the timely incorporation of ribosomal proteins by delaying specific folding steps in the 3′ major domain of the 20S pre-ribosomal RNA.",
    "Publication data": "GSE52878",
    "Publication doi": "10.1093/nar/gku815",
    "Probe": "In vitro (1M7, DMS); In vivo (NAI)",
    "Probe class": "Chemical",
    "Probe target": "1M7 (2'-OH), DMS (N1A, N3C), NAI (2'-OH)",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "rRNA molecules",
    "Structure inferred": "Secondary",
    "Validated by": "18S rRNA",
    "Validated in": "Yeast",
    "Workflow": "<img alt='chemodseq fig' src='../images/chemmodseq.jpg'>",
    "Figure reuse license": "CC BY"
  },
  "8": {
    "Method": "CIRS-seq",
    "Year": 2014,
    "Name": "Chemical inference of RNA structures followed by massive parallel sequencing",
    "Publication": "Genome-wide profiling of mouse RNA secondary structures reveals key features of the mammalian transcriptome",
    "Published by": "Danny Incarnato, Francesco Neri, Francesca Anselmi and Salvatore Oliviero",
    "Publication abstract": "Background: The understanding of RNA structure is a key feature toward the comprehension of RNA functions and mechanisms of action. In particular, non-coding RNAs are thought to exert their functions by specific secondary structures, but an efficient annotation on a large scale of these structures is still missing. Results: By using a novel high-throughput method, named chemical inference of RNA structures, CIRS-seq, that uses dimethyl sulfate, and N-cyclohexyl- N'-(2-morpholinoethyl)carbodiimide metho-p-toluenesulfonate to modify RNA residues in single-stranded conformation within native deproteinized RNA secondary structures, we investigate the structural features of mouse embryonic stem cell transcripts. Our analysis reveals an unexpected higher structuring of the 5′ and 3′ untranslated regions compared to the coding regions, a reduced structuring at the Kozak sequence and stop codon, and a three-nucleotide periodicity across the coding region of messenger RNAs. We also observe that ncRNAs exhibit a higher degree of structuring with respect to protein coding transcripts. Moreover, we find that the Lin28a binding protein binds selectively to RNA motifs with a strong preference toward a single stranded conformation. Conclusions: This work defines for the first time the complete RNA structurome of mouse embryonic stem cells, revealing an extremely distinct RNA structural landscape. These results demonstrate that CIRS-seq constitutes an important tool for the identification of native deproteinized RNA structures.",
    "Publication data": "GSE54106",
    "Publication doi": "10.1186/s13059-014-0491-2",
    "Probe": "DMS, CMCT",
    "Probe class": "Chemical",
    "Probe target": "CMCT (N1G, N3U); DMS (N1A, N3C)",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "mt-Te, U5 snRNA",
    "Validated in": "Mouse",
    "Workflow": "<img alt='cirs-seq fig' src='../imagges/cirs-seq.jpg'>",
    "Figure reuse license": "CC BY 4.0"
  },
  "9": {
    "Method": "DMS-seq",
    "Year": 2014,
    "Name": "_NA_",
    "Publication": "Genome-wide probing of RNA structure reveals active unfolding of mRNA structures in vivo",
    "Published by": "Silvi Rouskin, Meghan Zubradt, Stefan Washietl, Manolis Kellis & Jonathan S. Weissman",
    "Publication abstract": "RNA has a dual role as an informational molecule and a direct effector of biological tasks. The latter function is enabled by RNA’s ability to adopt complex secondary and tertiary folds and thus has motivated extensive computational1,2 and experimental3,4,5,6,7,8 efforts for determining RNA structures. Existing approaches for evaluating RNA structure have been largely limited to in vitro systems, yet the thermodynamic forces which drive RNA folding in vitro may not be sufficient to predict stable RNA structures in vivo5. Indeed, the presence of RNA-binding proteins and ATP-dependent helicases can influence which structures are present inside cells. Here we present an approach for globally monitoring RNA structure in native conditions in vivo with single-nucleotide precision. This method is based on in vivo modification with dimethyl sulphate (DMS), which reacts with unpaired adenine and cytosine residues9, followed by deep sequencing to monitor modifications. Our data from yeast and mammalian cells are in excellent agreement with known messenger RNA structures and with the high-resolution crystal structure of the Saccharomyces cerevisiae ribosome10. Comparison between in vivo and in vitro data reveals that in rapidly dividing cells there are vastly fewer structured mRNA regions in vivo than in vitro. Even thermostable RNA structures are often denatured in cells, highlighting the importance of cellular processes in regulating RNA structure. Indeed, analysis of mRNA structure under ATP-depleted conditions in yeast shows that energy-dependent processes strongly contribute to the predominantly unfolded state of mRNAs inside cells. Our studies broadly enable the functional analysis of physiological RNA structures and reveal that, in contrast to the Anfinsen view of protein folding whereby the structure formed is the most thermodynamically favourable, thermodynamics have an incomplete role in determining mRNA structure in vivo.",
    "Publication data": "GSE45803",
    "Publication doi": "10.1038/nature12894",
    "Probe": "DMS",
    "Probe class": "Chemical",
    "Probe target": "N1A, N3C",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "HAC1, RPS28B, and ASH1",
    "Validated in": "Yeast",
    "Workflow": "<img alt='dms-seq fig1' src='../images/dms-seq.jpg'>",
    "Figure reuse license": "4616940566453"
  },
  "10": {
    "Method": "HRF-seq",
    "Year": 2014,
    "Name": "Parallel-sequencing-based method for probing RNA accessibility with hydroxyl radicals",
    "Publication": "Massive parallel-sequencing-based hydroxyl radical probing of RNA accessibility",
    "Published by": "Lukasz Jan Kielpinski, Jeppe Vinther ",
    "Publication abstract": "Hydroxyl Radical Footprinting (HRF) is a tried-and-tested method for analysis of the tertiary structure of RNA and for identification of protein footprints on RNA. The hydroxyl radical reaction breaks accessible parts of the RNA backbone, thereby allowing ribose accessibility to be determined by detection of reverse transcriptase termination sites. Current methods for HRF rely on reverse transcription of a single primer and detection by fluorescent fragments by capillary electrophoresis. Here, we describe an accurate and efficient massive parallel-sequencing-based method for probing RNA accessibility with hydroxyl radicals, called HRF-Seq. Using random priming and a novel barcoding scheme, we show that HRF-Seq dramatically increases the throughput of HRF experiments and facilitates the parallel analysis of multiple RNAs or experimental conditions. Moreover, we demonstrate that HRF-Seq data for the Escherichia coli 16S rRNA correlates well with the ribose accessible surface area as determined by X-ray crystallography and have a resolution that readily allows the difference in accessibility caused by exposure of one side of RNA helices to be observed.",
    "Publication data": "http://people.binf.ku.dk/jvinther/data/HRF-Seq/",
    "Publication doi": "10.1093/nar/gku167",
    "Probe": "Hydroxyl radical",
    "Probe class": "Chemical",
    "Probe target": "Ribose C4' and C5'",
    "Target region": "Solvant accessible part",
    "Readout": "RT stop",
    "Experimental setting": "In vitro",
    "Scale": "Multiple RNAs",
    "Structure inferred": "Tertiary",
    "Validated by": "16S rRNA",
    "Validated in": "Escherichia coli",
    "Workflow": "<img alt='hrf-seq fig1' src='../images/hrf-seq.jpeg'>",
    "Figure reuse license": "CC BY"
  },
  "11": {
    "Method": "MAP-seq",
    "Year": 2014,
    "Name": "Multiplexed Accessibility Probing read out through sequencing",
    "Publication": "Massively Parallel RNA Chemical Mapping with a Reduced Bias MAP-Seq Protocol",
    "Published by": "Seetin M.G., Kladwang W., Bida J.P., Das R.",
    "Publication abstract": "Chemical mapping methods probe RNA structure by revealing and leveraging correlations of a nucleotide’s structural accessibility or flexibility with its reactivity to various chemical probes. Pioneering work by Lucks and colleagues has expanded this method to probe hundreds of molecules at once on an Illumina sequencing platform, obviating the use of slab gels or capillary electrophoresis on one molecule at a time. Here, we describe optimizations to this method from our lab, resulting in the MAP-seq protocol (Multiplexed Accessibility Probing read out through sequencing), version 1.0. The protocol permits the quantitative probing of thousands of RNAs at once, by several chemical modification reagents, on the time scale of a day using a tabletop Illumina machine. This method and a software package MAPseeker (http://simtk.org/home/map_seeker) address several potential sources of bias, by eliminating PCR steps, improving ligation efficiencies of ssDNA adapters, and avoiding problematic heuristics in prior algorithms. We hope that the step-by-step description of MAP-seq 1.0 will help other RNA mapping laboratories to transition from electrophoretic to next-generation sequencing methods and to further reduce the turnaround time and any remaining biases of the protocol.",
    "Publication data": "_NA_",
    "Publication doi": "10.1007/978-1-62703-667-2_6",
    "Probe": "DMS, NMIA, CMCT, 1M7",
    "Probe class": "Chemical",
    "Probe target": "DMS (N1A, N3C); CMCT (N1G, N3U); 1M7 (2'-OH); NMIA (2'-OH)",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vitro",
    "Scale": "Thousands of RNA molecules",
    "Structure inferred": "Secondary",
    "Validated by": "Double hairpin RNA Therm1",
    "Validated in": "_NA_",
    "Workflow": "_NA_",
    "Figure reuse license": "_NA_"
  },
  "12": {
    "Method": "Mod-seq",
    "Year": 2014,
    "Name": "_NA_",
    "Publication": "Mod-seq: high-throughput sequencing for chemical probing of RNA structure",
    "Published by": "Jason Talkish, Gemma May, Yizhu Lin, John L. Woolford, Jr., and C. Joel McManus ",
    "Publication abstract": "The functions of RNA molecules are intimately linked to their ability to fold into complex secondary and tertiary structures. Thus, understanding how these molecules fold is essential to determining how they function. Current methods for investigating RNA structure often use small molecules, enzymes, or ions that cleave or modify the RNA in a solvent-accessible manner. While these methods have been invaluable to understanding RNA structure, they can be fairly labor intensive and often focus on short regions of single RNAs. Here we present a new method (Mod-seq) and data analysis pipeline (Mod-seeker) for assaying the structure of RNAs by high-throughput sequencing. This technique can be utilized both in vivo and in vitro, with any small molecule that modifies RNA and consequently impedes reverse transcriptase. As proof-of-principle, we used dimethyl sulfate (DMS) to probe the in vivo structure of total cellular RNAs in Saccharomyces cerevisiae. Mod-seq analysis simultaneously revealed secondary structural information for all four ribosomal RNAs and 32 additional noncoding RNAs. We further show that Mod-seq can be used to detect structural changes in 5.8S and 25S rRNAs in the absence of ribosomal protein L26, correctly identifying its binding site on the ribosome. While this method is applicable to RNAs of any length, its high-throughput nature makes Mod-seq ideal for studying long RNAs and complex RNA mixtures. ",
    "Publication data": "SRP029192",
    "Publication doi": "10.1261/rna.042218.113",
    "Probe": "Any (e.g. DMS)",
    "Probe class": "Chemical",
    "Probe target": "Dependent on probe",
    "Target region": "Dependent on probe",
    "Readout": "RT stop",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "scR1",
    "Validated in": "Yeast",
    "Workflow": "<img alt='mod-seq fig1' src='../images/mod-seq.jpg'>",
    "Figure reuse license": "CC BY-NC 4.0"
  },
  "13": {
    "Method": "RING-MaP",
    "Year": 2014,
    "Name": "RNA interaction groups by mutational profiling (RING-MaP)",
    "Publication": "Single-molecule correlated chemical probing of RNA",
    "Published by": "Philip J. Homan, Oleg V. Favorov, Christopher A. Lavender, Olcay Kursun, Xiyuan Ge, Steven Busan, Nikolay V. Dokholyan, and Kevin M. Weeks",
    "Publication abstract": "Complex higher-order RNA structures play critical roles in all facets of gene expression; however, the through-space interaction networks that define tertiary structures and govern sampling of multiple conformations are poorly understood. Here we describe single-molecule RNA structure analysis in which multiple sites of chemical modification are identified in single RNA strands by massively parallel sequencing and then analyzed for correlated and clustered interactions. The strategy thus identifies RNA interaction groups by mutational profiling (RING-MaP) and makes possible two expansive applications. First, we identify through-space interactions, create 3D models for RNAs spanning 80–265 nucleotides, and characterize broad classes of intramolecular interactions that stabilize RNA. Second, we distinguish distinct conformations in solution ensembles and reveal previously undetected hidden states and large-scale structural reconfigurations that occur in unfolded RNAs relative to native states. RING-MaP single-molecule nucleic acid structure interrogation enables concise and facile analysis of the global architectures and multiple conformations that govern function in RNA.",
    "Publication data": "SRP046153",
    "Publication doi": "10.1073/pnas.1407306111",
    "Probe": "DMS",
    "Probe class": "Chemical",
    "Probe target": "N1A, N3C",
    "Target region": "Single stranded",
    "Readout": "RT mutation",
    "Experimental setting": "In vitro",
    "Scale": "Single molecule",
    "Structure inferred": "Tertiary",
    "Validated by": "Escherichia coli thiamine pyrophosphate (TPP) riboswitch, Tetrahymena group I intron P546 domain, and Bacillus stearothermophilus RNase P catalytic domain",
    "Validated in": "Escherichia coli, Tetrahymena, Bacillus stearothermophilus",
    "Workflow": "<img alt='ring-map fig1' src='../images/ring-map.jpg'>",
    "Figure reuse license": "Granted by PNAS Executive Editor Diane Sullenberger"
  },
  "14": {
    "Method": "SHAPE-MaP",
    "Year": 2014,
    "Name": "Selective 2'-hydroxyl acylation analyzed by primer extension and mutational profiling",
    "Publication": "RNA motif discovery by SHAPE and mutational profiling (SHAPE-MaP)",
    "Published by": "Nathan A Siegfried, Steven Busan, Greggory M Rice, Julie A E Nelson & Kevin M Weeks",
    "Publication abstract": "Many biological processes are RNA-mediated, but higher-order structures for most RNAs are unknown, which makes it difficult to understand how RNA structure governs function. Here we describe selective 2′-hydroxyl acylation analyzed by primer extension and mutational profiling (SHAPE-MaP) that makes possible de novo and large-scale identification of RNA functional motifs. Sites of 2′-hydroxyl acylation by SHAPE are encoded as noncomplementary nucleotides during cDNA synthesis, as measured by massively parallel sequencing. SHAPE-MaP–guided modeling identified greater than 90% of accepted base pairs in complex RNAs of known structure, and we used it to define a new model for the HIV-1 RNA genome. The HIV-1 model contains all known structured motifs and previously unknown elements, including experimentally validated pseudoknots. SHAPE-MaP yields accurate and high-resolution secondary-structure models, enables analysis of low-abundance RNAs, disentangles sequence polymorphisms in single experiments and will ultimately democratize RNA-structure analysis.",
    "Publication data": "SRX554885",
    "Publication doi": "10.1038/nmeth.3029",
    "Probe": "1M7, 1M6, NMIA",
    "Probe class": "Chemical",
    "Probe target": "Ribose 2'-OH",
    "Target region": "Single stranded",
    "Readout": "RT mutation",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "Thiamine pyrophosphate (TPP) riboswitch aptamer domain, 16S rRNA",
    "Validated in": "Escherichia coli",
    "Workflow": "<img alt='shape-map fig1' src='../images/shape-map.jpg'>",
    "Figure reuse license": "4616941042121"
  },
  "15": {
    "Method": "SHAPE-Seq v2.0",
    "Year": 2014,
    "Name": "Selective 2'-hydroxyl acylation analyzed by primer extension sequencing v2.0",
    "Publication": "SHAPE-Seq 2.0: systematic optimization and extension of high-throughput chemical probing of RNA secondary structure with next generation sequencing",
    "Published by": "David Loughrey, Kyle E. Watters, Alexander H. Settle, Julius B. Lucks",
    "Publication abstract": "RNA structure is a primary determinant of its function, and methods that merge chemical probing with next generation sequencing have created breakthroughs in the throughput and scale of RNA structure characterization. However, little work has been done to examine the effects of library preparation and sequencing on the measured chemical probe reactivities that encode RNA structural information. Here, we present the first analysis and optimization of these effects for selective 2′-hydroxyl acylation analyzed by primer extension sequencing (SHAPE-Seq). We first optimize SHAPE-Seq, and show that it provides highly reproducible reactivity data over a wide range of RNA structural contexts with no apparent biases. As part of this optimization, we present SHAPE-Seq v2.0, a ‘universal’ method that can obtain reactivity information for every nucleotide of an RNA without having to use or introduce a specific reverse transcriptase priming site within the RNA. We show that SHAPE-Seq v2.0 is highly reproducible, with reactivity data that can be used as constraints in RNA folding algorithms to predict structures on par with those generated using data from other SHAPE methods. We anticipate SHAPE-Seq v2.0 to be broadly applicable to understanding the RNA sequence–structure relationship at the heart of some of life's most fundamental processes.",
    "Publication data": "Supplementary Table S7",
    "Publication doi": "10.1093/nar/gku909",
    "Probe": "1M7",
    "Probe class": "Chemical",
    "Probe target": "Ribose 2'-OH",
    "Target region": "Single stranded",
    "Readout": "RT mutation",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "Vibrio vulnificus adenine riboswitch, Bacillus subtilis RNAse P specificity domain",
    "Validated in": "Vibrio vulnificus, Bacillus subtilis",
    "Workflow": "<img alt='shape-seq v2 fig4' src='../images/shape-seqv2.jpeg'>",
    "Figure reuse license": "CC BY"
  },
  "16": {
    "Method": "Structure-seq",
    "Year": 2014,
    "Name": "_NA_",
    "Publication": "In vivo genome-wide profiling of RNA secondary structure reveals novel regulatory features",
    "Published by": "Yiliang Ding, Yin Tang, Chun Kit Kwok, Yu Zhang, Philip C. Bevilacqua & Sarah M. Assmann",
    "Publication abstract": "RNA structure has critical roles in processes ranging from ligand sensing to the regulation of translation, polyadenylation and splicing1,2,3,4. However, a lack of genome-wide in vivo RNA structural data has limited our understanding of how RNA structure regulates gene expression in living cells. Here we present a high-throughput, genome-wide in vivo RNA structure probing method, structure-seq, in which dimethyl sulphate methylation of unprotected adenines and cytosines is identified by next-generation sequencing. Application of this method to Arabidopsis thaliana seedlings yielded the first in vivo genome-wide RNA structure map at nucleotide resolution for any organism, with quantitative structural information across more than 10,000 transcripts. Our analysis reveals a three-nucleotide periodic repeat pattern in the structure of coding regions, as well as a less-structured region immediately upstream of the start codon, and shows that these features are strongly correlated with translation efficiency. We also find patterns of strong and weak secondary structure at sites of alternative polyadenylation, as well as strong secondary structure at 5′ splice sites that correlates with unspliced events. Notably, in vivo structures of messenger RNAs annotated for stress responses are poorly predicted in silico, whereas mRNA structures of genes related to cell function maintenance are well predicted. Global comparison of several structural features between these two categories shows that the mRNAs associated with stress responses tend to have more single-strandedness, longer maximal loop length and higher free energy per nucleotide, features that may allow these RNAs to undergo conformational changes in response to environmental conditions. Structure-seq allows the RNA structurome and its biological roles to be interrogated on a genome-wide scale and should be applicable to any organism.",
    "Publication data": "SRP027216",
    "Publication doi": "10.1038/nature12756",
    "Probe": "DMS",
    "Probe class": "Chemical",
    "Probe target": "N1A, N3C",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "18S RNA",
    "Validated in": "Arabidopsis thaliana",
    "Workflow": "<img alt='structure-seq fig1' src='../images/structure-seq.jpg'>",
    "Figure reuse license": "4647551269099"
  },
  "17": {
    "Method": "hiCLIP",
    "Year": 2015,
    "Name": "RNA hybrid and individual-nucleotide resolution ultraviolet crosslinking and immunoprecipitation",
    "Publication": "hiCLIP reveals the in vivo atlas of mRNA secondary structures recognized by Staufen 1",
    "Published by": "Yoichiro Sugimoto, Alessandra Vigilante, Elodie Darbo, Alexandra Zirra, Cristina Militti, Andrea D’Ambrogio, Nicholas M. Luscombe & Jernej Ule",
    "Publication abstract": "The structure of messenger RNA is important for post-transcriptional regulation, mainly because it affects binding of trans-acting factors1. However, little is known about the in vivo structure of full-length mRNAs. Here we present hiCLIP, a biochemical technique for transcriptome-wide identification of RNA secondary structures interacting with RNA-binding proteins (RBPs). Using this technique to investigate RNA structures bound by Staufen 1 (STAU1) in human cells, we uncover a dominance of intra-molecular RNA duplexes, a depletion of duplexes from coding regions of highly translated mRNAs, an unexpected prevalence of long-range duplexes in 3′ untranslated regions (UTRs), and a decreased incidence of single nucleotide polymorphisms in duplex-forming regions. We also discover a duplex spanning 858 nucleotides in the 3′ UTR of the X-box binding protein 1 (XBP1) mRNA that regulates its cytoplasmic splicing and stability. Our study reveals the fundamental role of mRNA secondary structures in gene expression and introduces hiCLIP as a widely applicable method for discovering new, especially long-range, RNA duplexes.",
    "Publication data": "ArrayExpress (E-MTAB-2937, E-MTAB-2940, E-MTAB-2941)",
    "Publication doi": "10.1038/nature14280",
    "Probe": "_NA_",
    "Probe class": "Crosslinking and ligation",
    "Probe target": "_NA_",
    "Target region": "Duplexes",
    "Readout": "_NA_",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "mRNAs bound by Staufen 1, ARF1, 18S, and 28S rRNA",
    "Validated in": "Human",
    "Workflow": "<img alt='hiclip Extended data figure 1' src='../images/hiclip.jpg'>",
    "Figure reuse license": "4616941282938"
  },
  "18": {
    "Method": "icSHAPE",
    "Year": 2015,
    "Name": "In vivo click selective 2'-hydroxyl acylation and profiling experiment",
    "Publication": "Structural imprints in vivo decode RNA regulatory mechanisms",
    "Published by": "Robert C. Spitale, Ryan A. Flynn, Qiangfeng Cliff Zhang, Pete Crisalli, Byron Lee, Jong-Wha Jung, Hannes Y. Kuchelmeister, Pedro J. Batista, Eduardo A. Torre, Eric T. Kool & Howard Y. Chang",
    "Publication abstract": "Visualizing the physical basis for molecular behaviour inside living cells is a great challenge for biology. RNAs are central to biological regulation, and the ability of RNA to adopt specific structures intimately controls every step of the gene expression program1. However, our understanding of physiological RNA structures is limited; current in vivo RNA structure profiles include only two of the four nucleotides that make up RNA2,3. Here we present a novel biochemical approach, in vivo click selective 2′-hydroxyl acylation and profiling experiment (icSHAPE), which enables the first global view, to our knowledge, of RNA secondary structures in living cells for all four bases. icSHAPE of the mouse embryonic stem cell transcriptome versus purified RNA folded in vitro shows that the structural dynamics of RNA in the cellular environment distinguish different classes of RNAs and regulatory elements. Structural signatures at translational start sites and ribosome pause sites are conserved from in vitro conditions, suggesting that these RNA elements are programmed by sequence. In contrast, focal structural rearrangements in vivo reveal precise interfaces of RNA with RNA-binding proteins or RNA-modification sites that are consistent with atomic-resolution structural data. Such dynamic structural footprints enable accurate prediction of RNA–protein interactions and N6-methyladenosine (m6A) modification genome wide. These results open the door for structural genomics of RNA in living cells and reveal key physiological structures controlling gene expression.",
    "Publication data": "GSE64169",
    "Publication doi": "10.1038/nature14263",
    "Probe": "NAI-N3",
    "Probe class": "Chemical",
    "Probe target": "Ribose 2'-OH",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "18S and 28S rRNA",
    "Validated in": "Mouse",
    "Workflow": "<img alt='icshape fig1' src='../images/icshape.jpg'>",
    "Figure reuse license": "4616950067260"
  },
  "19": {
    "Method": "MOHCA-seq",
    "Year": 2015,
    "Name": "Multiplexed OH Cleavage Analysis with paired-end sequencing",
    "Publication": "Consistent global structures of complex RNA states through multidimensional chemical mapping",
    "Published by": " Clarence Yu Cheng, Fang-Chieh Chou, Wipapat Kladwang, Siqi Tian, Pablo Cordero, Rhiju Das",
    "Publication abstract": "Accelerating discoveries of non-coding RNA (ncRNA) in myriad biological processes pose major challenges to structural and functional analysis. Despite progress in secondary structure modeling, high-throughput methods have generally failed to determine ncRNA tertiary structures, even at the 1-nm resolution that enables visualization of how helices and functional motifs are positioned in three dimensions. We report that integrating a new method called MOHCA-seq (Multiplexed •OH Cleavage Analysis with paired-end sequencing) with mutate-and-map secondary structure inference guides Rosetta 3D modeling to consistent 1-nm accuracy for intricately folded ncRNAs with lengths up to 188 nucleotides, including a blind RNA-puzzle challenge, the lariat-capping ribozyme. This multidimensional chemical mapping (MCM) pipeline resolves unexpected tertiary proximities for cyclic-di-GMP, glycine, and adenosylcobalamin riboswitch aptamers without their ligands and a loose structure for the recently discovered human HoxA9D internal ribosome entry site regulon. MCM offers a sequencing-based route to uncovering ncRNA 3D structure, applicable to functionally important but potentially heterogeneous states.",
    "Publication data": "In paper",
    "Publication doi": "10.7554/eLife.07600.002",
    "Probe": "Hydroxyl radical",
    "Probe class": "Chemical",
    "Probe target": "RNA backbone",
    "Target region": "Proximal nucleotide pairs without direct atom-atom contact",
    "Readout": "RT stop",
    "Experimental setting": "In vitro",
    "Scale": "Single molecule",
    "Structure inferred": "Tertiary",
    "Validated by": "Tetrahymena ribozyme P4–P6 domain",
    "Validated in": "Tetrahymena",
    "Workflow": "<img alt='mohca-seq fig1b' src='../images/mohca-seq.jpg'>",
    "Figure reuse license": "CC BY 4.0"
  },
  "20": {
    "Method": "RPL",
    "Year": 2015,
    "Name": "RNA proximity ligation",
    "Publication": "High-throughput determination of RNA structure by proximity ligation",
    "Published by": "Vijay Ramani, Ruolan Qiu & Jay Shendure",
    "Publication abstract": "We present an unbiased method to globally resolve RNA structures through pairwise contact measurements between interacting regions. RNA proximity ligation (RPL) uses proximity ligation of native RNA followed by deep sequencing to yield chimeric reads with ligation junctions in the vicinity of structurally proximate bases. We apply RPL in both baker's yeast (Saccharomyces cerevisiae) and human cells and generate contact probability maps for ribosomal and other abundant RNAs, including yeast snoRNAs, the RNA subunit of the signal recognition particle and the yeast U2 spliceosomal RNA homolog. RPL measurements correlate with established secondary structures for these RNA molecules, including stem-loop structures and long-range pseudoknots. We anticipate that RPL will complement the current repertoire of computational and experimental approaches in enabling the high-throughput determination of secondary and tertiary RNA structures.",
    "Publication data": "GSE69472",
    "Publication doi": "10.1038/nbt.3289",
    "Probe": "RNase",
    "Probe class": "Proximity ligation",
    "Probe target": "_NA_",
    "Target region": "Interacting region",
    "Readout": "_NA_",
    "Experimental setting": "In vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary and tertiary",
    "Validated by": "25S, 5.8S, 5S, and 18S rRNAs",
    "Validated in": "Yeast (Saccharomyces cerevisiae)",
    "Workflow": "<img alt='rpl fig1a' src='../images/rpl.jpg'>",
    "Figure reuse license": "4616950187657"
  },
  "21": {
    "Method": "SHAPES",
    "Year": 2015,
    "Name": "SHAPE Selection",
    "Publication": "SHAPE Selection (SHAPES) enrich for RNA structure signal in SHAPE sequencing-based probing data",
    "Published by": "Line Dahl Poulsen, Lukasz Jan Kielpinski, Sofie R. Salama, Anders Krogh, and Jeppe Vinther ",
    "Publication abstract": "Selective 2′ Hydroxyl Acylation analyzed by Primer Extension (SHAPE) is an accurate method for probing of RNA secondary structure. In existing SHAPE methods, the SHAPE probing signal is normalized to a no-reagent control to correct for the background caused by premature termination of the reverse transcriptase. Here, we introduce a SHAPE Selection (SHAPES) reagent, N-propanone isatoic anhydride (NPIA), which retains the ability of SHAPE reagents to accurately probe RNA structure, but also allows covalent coupling between the SHAPES reagent and a biotin molecule. We demonstrate that SHAPES-based selection of cDNA–RNA hybrids on streptavidin beads effectively removes the large majority of background signal present in SHAPE probing data and that sequencing-based SHAPES data contain the same amount of RNA structure data as regular sequencing-based SHAPE data obtained through normalization to a no-reagent control. Moreover, the selection efficiently enriches for probed RNAs, suggesting that the SHAPES strategy will be useful for applications with high-background and low-probing signal such as in vivo RNA structure probing. ",
    "Publication data": "http://people.binf.ku.dk/~jvinther/data/SHAPES-Seq/",
    "Publication doi": "10.1261/rna.047068.114",
    "Probe": "NPIA",
    "Probe class": "Chemical",
    "Probe target": "Ribose 2'-OH",
    "Target region": "Flexible",
    "Readout": "RT stop",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "Bacillus subtilis RNase P RNA, Escherichia coli 16S rRNA",
    "Validated in": "Bacillus subtilis, Escherichia coli",
    "Workflow": "<img alt='shapes fig2' src='../images/shapes.jpg'>",
    "Figure reuse license": "CC BY-NC 4.0"
  },
  "22": {
    "Method": "Targeted Structure-seq",
    "Year": 2015,
    "Name": "_NA_",
    "Publication": "Probing Xist RNA Structure in Cells Using Targeted Structure-Seq",
    "Published by": "Fang R, Moss WN, Rutenberg-Schoenberg M, Simon MD",
    "Publication abstract": "The long non-coding RNA (lncRNA) Xist is a master regulator of X-chromosome inactivation in mammalian cells. Models for how Xist and other lncRNAs function depend on thermodynamically stable secondary and higher-order structures that RNAs can form in the context of a cell. Probing accessible RNA bases can provide data to build models of RNA conformation that provide insight into RNA function, molecular evolution, and modularity. To study the structure of Xist in cells, we built upon recent advances in RNA secondary structure mapping and modeling to develop Targeted Structure-Seq, which combines chemical probing of RNA structure in cells with target-specific massively parallel sequencing. By enriching for signals from the RNA of interest, Targeted Structure-Seq achieves high coverage of the target RNA with relatively few sequencing reads, thus providing a targeted and scalable approach to analyze RNA conformation in cells. We use this approach to probe the full-length Xist lncRNA to develop new models for functional elements within Xist, including the repeat A element in the 5’-end of Xist. This analysis also identified new structural elements in Xist that are evolutionarily conserved, including a new element proximal to the C repeats that is important for Xist function.",
    "Publication data": "GSE67667",
    "Publication doi": "10.1371/journal.pgen.1005668",
    "Probe": "DMS",
    "Probe class": "Chemical",
    "Probe target": "N1A, N3C",
    "Target region": "Unpaired, unprotected, flexible, or GU wobble",
    "Readout": "RT stop",
    "Experimental setting": "In vivo",
    "Scale": "Single-molecule",
    "Structure inferred": "Secondary",
    "Validated by": "18S rRNA",
    "Validated in": "Murine (Mus musculus)",
    "Workflow": "<img alt='targeted structure-seq fig1b' src='../images/targeted-structure-seq.jpg'>",
    "Figure reuse license": "CC BY 4.0"
  },
  "23": {
    "Method": "in-cell SHAPE-seq",
    "Year": 2016,
    "Name": "_NA_",
    "Publication": "Simultaneous characterization of cellular RNA structure and function with in-cell SHAPE-Seq",
    "Published by": "Kyle E. Watters, Timothy R. Abbott, Julius B. Lucks",
    "Publication abstract": "Many non-coding RNAs form structures that interact with cellular machinery to control gene expression. A central goal of molecular and synthetic biology is to uncover design principles linking RNA structure to function to understand and engineer this relationship. Here we report a simple, high-throughput method called in-cell SHAPE-Seq that combines in-cell probing of RNA structure with a measurement of gene expression to simultaneously characterize RNA structure and function in bacterial cells. We use in-cell SHAPE-Seq to study the structure–function relationship of two RNA mechanisms that regulate translation in Escherichia coli. We find that nucleotides that participate in RNA–RNA interactions are highly accessible when their binding partner is absent and that changes in RNA structure due to RNA–RNA interactions can be quantitatively correlated to changes in gene expression. We also characterize the cellular structures of three endogenously expressed non-coding RNAs: 5S rRNA, RNase P and the btuB riboswitch. Finally, a comparison between in-cell and in vitro folded RNA structures revealed remarkable similarities for synthetic RNAs, but significant differences for RNAs that participate in complex cellular interactions. Thus, in-cell SHAPE-Seq represents an easily approachable tool for biologists and engineers to uncover relationships between sequence, structure and function of RNAs in the cell.",
    "Publication data": "http://rmdb.stanford.edu/repository/",
    "Publication doi": "10.1093/nar/gkv879",
    "Probe": "1M7",
    "Probe class": "Chemical",
    "Probe target": "Ribose 2'-OH",
    "Target region": "Single stranded",
    "Readout": "RT stop",
    "Experimental setting": "In vivo",
    "Scale": "Multiple RNAs",
    "Structure inferred": "Secondary",
    "Validated by": "5S rRNA, RNase P and the riboswitch domain of the btuB mRNA leader sequence",
    "Validated in": "Escherichia coli",
    "Workflow": "<img alt='in-cell-shape-seq fig1' src='../images/in-cell-shape-seq.png'>",
    "Figure reuse license": "CC BY"
  },
  "24": {
    "Method": "PARIS",
    "Year": 2016,
    "Name": "Psoralen analysis of RNA interactions and structures",
    "Publication": "RNA Duplex Map in Living Cells Reveals Higher-Order Transcriptome Structure",
    "Published by": "Lu Z, Zhang QC, Lee B, Flynn RA, Smith MA, Robinson JT, Davidovich C, Gooding AR, Goodrich KJ, Mattick JS, Mesirov JP, Cech TR, Chang HY",
    "Publication abstract": "RNA has the intrinsic property to base pair, forming complex structures fundamental to its diverse functions. Here, we develop PARIS, a method based on reversible psoralen crosslinking for global mapping of RNA duplexes with near base-pair resolution in living cells. PARIS analysis in three human and mouse cell types reveals frequent long-range structures, higher-order architectures, and RNA-RNA interactions in trans across the transcriptome. PARIS determines base-pairing interactions on an individual-molecule level, revealing pervasive alternative conformations. We used PARIS-determined helices to guide phylogenetic analysis of RNA structures and discovered conserved long-range and alternative structures. XIST, a long noncoding RNA (lncRNA) essential for X chromosome inactivation, folds into evolutionarily conserved RNA structural domains that span many kilobases. XIST A-repeat forms complex inter-repeat duplexes that nucleate higher-order assembly of the key epigenetic silencing protein SPEN. PARIS is a generally applicable and versatile method that provides novel insights into the RNA structurome and interactome. VIDEO ABSTRACT.",
    "Publication data": "GSE74353",
    "Publication doi": "10.1016/j.cell.2016.04.028",
    "Probe": "_NA_",
    "Probe class": "Crosslinking and ligation",
    "Probe target": "_NA_",
    "Target region": "Double stranded",
    "Readout": "_NA_",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "snRNA U7, MIR10A, TERC, RMRP, RPPH1",
    "Validated in": "Human, mouse",
    "Workflow": "_NA_",
    "Figure reuse license": "_NA_"
  },
  "25": {
    "Method": "SPLASH",
    "Year": 2016,
    "Name": "Sequencing of psoralen crosslinked, ligated, and selected hybrids",
    "Publication": "In Vivo Mapping of Eukaryotic RNA Interactomes Reveals Principles of Higher-Order Organization and Regulation",
    "Published by": "Aw, Jong Ghut Ashley, Shen, Yang, Wilm, Andreas, Sun, Miao, Lim, Xin Ni, Boon, Kum-Loong, Tapsin, Sidika, Chan, Yun-Shen, Tan, Cheng-Peow, Sim, Adelene Y.L., Zhang, Tong, Susanto, Teodorus Theo, Fu, Zhiyan, Nagarajan, Niranjan, Wan, Yue",
    "Publication abstract": "Identifying pairwise RNA-RNA interactions is key to understanding how RNAs fold and interact with other RNAs inside the cell. We present a high-throughput approach, sequencing of psoralen crosslinked, ligated, and selected hybrids (SPLASH), that maps pairwise RNA interactions in vivo with high sensitivity and specificity, genome-wide. Applying SPLASH to human and yeast transcriptomes revealed the diversity and dynamics of thousands of long-range intra- and intermolecular RNA-RNA interactions. Our analysis highlighted key structural features of RNA classes, including the modular organization of mRNAs, its impact on translation and decay, and the enrichment of long-range interactions in noncoding RNAs. Additionally, intermolecular mRNA interactions were organized into network clusters and were remodeled during cellular differentiation. We also identified hundreds of known and new snoRNA-rRNA binding sites, expanding our knowledge of rRNA biogenesis. These results highlight the underexplored complexity of RNA interactomes and pave the way to better understanding how RNA organization impacts biology.",
    "Publication data": "SRP073550",
    "Publication doi": "10.1016/j.molcel.2016.04.028",
    "Probe": "_NA_",
    "Probe class": "Crosslinking and ligation",
    "Probe target": "_NA_",
    "Target region": "Double stranded",
    "Readout": "_NA_",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "80S rRNA",
    "Validated in": "Human, yeast",
    "Workflow": "_NA_",
    "Figure reuse license": "_NA_"
  },
  "26": {
    "Method": "DMS-MaPseq",
    "Year": 2017,
    "Name": "Dimethyl sulfate mutational profiling with sequencing",
    "Publication": "DMS-MaPseq for genome-wide or targeted RNA structure probing in vivo",
    "Published by": "Meghan Zubradt, Paromita Gupta, Sitara Persad, Alan M Lambowitz, Jonathan S Weissman & Silvi Rouskin",
    "Publication abstract": "Coupling of structure-specific in vivo chemical modification to next-generation sequencing is transforming RNA secondary structure studies in living cells. The dominant strategy for detecting in vivo chemical modifications uses reverse transcriptase truncation products, which introduce biases and necessitate population-average assessments of RNA structure. Here we present dimethyl sulfate (DMS) mutational profiling with sequencing (DMS-MaPseq), which encodes DMS modifications as mismatches using a thermostable group II intron reverse transcriptase. DMS-MaPseq yields a high signal-to-noise ratio, can report multiple structural features per molecule, and allows both genome-wide studies and focused in vivo investigations of even low-abundance RNAs. We apply DMS-MaPseq for the first analysis of RNA structure within an animal tissue and to identify a functional structure involved in noncanonical translation initiation. Additionally, we use DMS-MaPseq to compare the in vivo structure of pre-mRNAs with their mature isoforms. These applications illustrate DMS-MaPseq's capacity to dramatically expand in vivo analysis of RNA structure.",
    "Publication data": "GSE84537",
    "Publication doi": "10.1038/nmeth.4057",
    "Probe": "DMS",
    "Probe class": "Chemical",
    "Probe target": "N1A, N3C",
    "Target region": "Single stranded",
    "Readout": "RT mutation",
    "Experimental setting": "In vivo",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary",
    "Validated by": "Yeast: 25S rRNA, HAC1, RPS28B; human: XBP1, MSRB1",
    "Validated in": "Yeast, human",
    "Workflow": "<img alt='dms-mapseq fig1' src='../images/dms-mapseq.jpg'>",
    "Figure reuse license": "4616950247866"
  },
  "27": {
    "Method": "LASER-MaP",
    "Year": 2018,
    "Name": "LASER-Mutational Profiling",
    "Publication": "Assaying RNA structure with LASER-Seq",
    "Published by": "Boris Zinshteyn, Dalen Chan, Whitney England, Chao Feng, Rachel Green, Robert C Spitale",
    "Publication abstract": "Chemical probing methods are crucial to our understanding of the structure and function of RNA molecules. The majority of chemical methods used to probe RNA structure report on Watson–Crick pairing, but tertiary structure parameters such as solvent accessibility can provide an additional layer of structural information, particularly in RNA-protein complexes. Herein we report the development of Light Activated Structural Examination of RNA by high-throughput sequencing, or LASER-Seq, for measuring RNA structure in cells with deep sequencing. LASER relies on a light-generated nicotinoyl nitrenium ion to form covalent adducts with the C8 position of adenosine and guanosine. Reactivity is governed by the accessibility of C8 to the light-generated probe. We compare structure probing by RT-stop and mutational profiling (MaP), demonstrating that LASER can be integrated with both platforms for RNA structure analyses. We find that LASER reactivity correlates with solvent accessibility across the entire ribosome, and that LASER can be used to rapidly survey for ligand binding sites in an unbiased fashion. LASER has a particular advantage in this last application, as it readily modifies paired nucleotides, enabling the identification of binding sites and conformational changes in highly structured RNA.",
    "Publication data": "GSE113529",
    "Publication doi": "10.1093/nar/gky1172",
    "Probe": "NAz",
    "Probe class": "Chemical",
    "Probe target": "C8A, C8G",
    "Target region": "Solvant accessible part",
    "Readout": "RT mutation",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary and tertiary",
    "Validated by": "16S rRNA, 25S rRNA, 23S rRNA, 18S rRNA",
    "Validated in": "Escherichia coli, Saccharomyces cerevisiae, human",
    "Workflow": "<img alt='laser map seq fig1b' src='../images/laser-map-seq.jpeg'>",
    "Figure reuse license": "CC BY"
  },
  "28": {
    "Method": "LASER-Seq",
    "Year": 2018,
    "Name": "Light Activated Structural Examination of RNA by high throughput sequencing",
    "Publication": "Assaying RNA structure with LASER-Seq",
    "Published by": "Boris Zinshteyn, Dalen Chan, Whitney England, Chao Feng, Rachel Green, Robert C Spitale",
    "Publication abstract": "Chemical probing methods are crucial to our understanding of the structure and function of RNA molecules. The majority of chemical methods used to probe RNA structure report on Watson–Crick pairing, but tertiary structure parameters such as solvent accessibility can provide an additional layer of structural information, particularly in RNA-protein complexes. Herein we report the development of Light Activated Structural Examination of RNA by high-throughput sequencing, or LASER-Seq, for measuring RNA structure in cells with deep sequencing. LASER relies on a light-generated nicotinoyl nitrenium ion to form covalent adducts with the C8 position of adenosine and guanosine. Reactivity is governed by the accessibility of C8 to the light-generated probe. We compare structure probing by RT-stop and mutational profiling (MaP), demonstrating that LASER can be integrated with both platforms for RNA structure analyses. We find that LASER reactivity correlates with solvent accessibility across the entire ribosome, and that LASER can be used to rapidly survey for ligand binding sites in an unbiased fashion. LASER has a particular advantage in this last application, as it readily modifies paired nucleotides, enabling the identification of binding sites and conformational changes in highly structured RNA.",
    "Publication data": "GSE113529",
    "Publication doi": "10.1093/nar/gky1172",
    "Probe": "NAz",
    "Probe class": "Chemical",
    "Probe target": "C8A, C8G",
    "Target region": "Solvant accessible part",
    "Readout": "RT stop",
    "Experimental setting": "In vivo and in vitro",
    "Scale": "Transcriptome-wide",
    "Structure inferred": "Secondary and tertiary",
    "Validated by": "16S rRNA, 25S rRNA, 23S rRNA, 18S rRNA",
    "Validated in": "Escherichia coli, Saccharomyces cerevisiae, human",
    "Workflow": "<img alt='laser map seq fig1b' src='../images/laser-map-seq.jpeg'>",
    "Figure reuse license": "CC BY"
  },
  "29": {
    "Method": "COMRADES",
    "Year": 2018,
    "Name": "Cross-linking of matched RNAs and deep sequencing",
    "Publication": "COMRADES determines in vivo RNA structures and interactions",
    "Published by": "Omer Ziv, Marta M. Gabryelska, Aaron T. L. Lun, Luca F. R. Gebert, Jessica Sheu-Gruttadauria, Luke W. Meredith, Zhong-Yu Liu, Chun Kit Kwok, Cheng-Feng Qin, Ian J. MacRae, Ian Goodfellow, John C. Marioni, Grzegorz Kudla & Eric A. Miska ",
    "Publication abstract": "The structural flexibility of RNA underlies fundamental biological processes, but there are no methods for exploring the multiple conformations adopted by RNAs in vivo. We developed cross-linking of matched RNAs and deep sequencing (COMRADES) for in-depth RNA conformation capture, and a pipeline for the retrieval of RNA structural ensembles. Using COMRADES, we determined the architecture of the Zika virus RNA genome inside cells, and identified multiple site-specific interactions with human noncoding RNAs.",
    "Publication data": "E-MTAB-6427",
    "Publication doi": "10.1038/s41592-018-0121-0",
    "Probe": "_NA_",
    "Probe class": "Crosslinking and ligation",
    "Probe target": "_NA_",
    "Target region": "Duplexes",
    "Readout": "_NA_",
    "Experimental setting": "In vivo",
    "Scale": "Selective RNA",
    "Structure inferred": "Secondary",
    "Validated by": "18S rRNA",
    "Validated in": "Human",
    "Workflow": "<img alt='comrades fig1a' src='../images/comrades.png'>",
    "Figure reuse license": "4616950308067"
  }
}